#Область ОписаниеПеременных

#КонецОбласти

#Область ОбработчикиСобытийФормы

// Код процедур и функций

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

// Код процедур и функций

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СгенерироватьКодПоТекущемуУсловномуОформлению(Команда)

	Результат = "";
	СгенерироватьКодПоТекущемуУсловномуОформлениюНаСервере();

КонецПроцедуры

&НаКлиенте
Процедура ОчиститьУсловноОформление(Команда)
	ОчиститьУсловноОформлениеНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ТестовыйПример1(Команда)
	ТестовыйПример1НаСервере();
КонецПроцедуры


&НаКлиенте
Процедура ТестовыйПример2(Команда)
	ТестовыйПример2НаСервере();
КонецПроцедуры
#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура СгенерироватьКодПоТекущемуУсловномуОформлениюНаСервере()

	Результат = Обработки.УсловноеОформление.СоздатьОбъект(УсловноеОформление).СгенерироватьКод();

КонецПроцедуры

&НаСервере
Процедура ОчиститьУсловноОформлениеНаСервере()

	Обработки.УсловноеОформление.СоздатьОбъект(УсловноеОформление).Очистить();

КонецПроцедуры

&НаСервере
Процедура ТестовыйПример1НаСервере()

	Обработки.УсловноеОформление.СоздатьОбъект(УсловноеОформление)
		.Элемент("Реквизит2")
			.ГруппаИ()
				.Равно("Реквизит2", 5)
			.Оформление("ЦветФона", WebЦвета.ЛососьСветлый);

КонецПроцедуры

&НаСервере
Процедура ТестовыйПример2НаСервере()
	
	Обработки.УсловноеОформление.СоздатьОбъект(УсловноеОформление)
		.Элемент("Реквизит2")
			.ГруппаИ()
				.Равно("Реквизит2", 0)
				.НеРавно("Реквизит3", Истина)
				.ГруппаИли()
					.Равно("Реквизит4", Истина)
					.НачинаетсяС("Реквизит1", "я")
				.КонецГруппы()
			.КонецГруппы()
			.Оформление("ЦветФона", WebЦвета.Золотой);

КонецПроцедуры

#КонецОбласти