#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СгенерироватьКодПоТекущемуУсловномуОформлению(Команда)

	СгенерироватьКодПоТекущемуУсловномуОформлениюНаСервере();

КонецПроцедуры

&НаКлиенте
Процедура ОчиститьУсловноОформление(Команда)
	ОчиститьУсловноОформлениеНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ПрименитьУсловноеОформления(Команда)
	ПрименитьУсловноеОформленияНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура Тест1(Команда)

	Реквизит2 = 5;

	Тест1НаСервере();

КонецПроцедуры

&НаКлиенте
Процедура Тест2(Команда)

	Реквизит2 = 0;
	Реквизит3 = Ложь;
	Реквизит4 = Истина;

	Тест2НаСервере();

КонецПроцедуры

&НаКлиенте
Процедура Тест3(Команда)

	Реквизит3 = Истина;

	Тест3НаСервере();

КонецПроцедуры

&НаКлиенте
Процедура Тест4(Команда)

	Реквизит2 = 0;

	Тест4НаСервере();

КонецПроцедуры

&НаКлиенте
Процедура Тест5(Команда)

	Реквизит2 = 0;

	Состав.Очистить();

	НоваяСтрока = Состав.Добавить();
	НоваяСтрока.Реквизит3 = Истина;
	НоваяСтрока = Состав.Добавить();

	НоваяСтрока = Состав.Добавить();
	НоваяСтрока.Реквизит3 = Истина;
	НоваяСтрока = Состав.Добавить();

	Тест5НаСервере();

КонецПроцедуры

&НаКлиенте
Процедура Тест6(Команда)

	Реквизит2 = 0;

	Состав.Очистить();

	НоваяСтрока = Состав.Добавить();
	НоваяСтрока.Реквизит3 = Истина;
	НоваяСтрока = Состав.Добавить();

	НоваяСтрока = Состав.Добавить();
	НоваяСтрока.Реквизит3 = Истина;
	НоваяСтрока = Состав.Добавить();

	Тест6НаСервере();

КонецПроцедуры

&НаКлиенте
Процедура Тест7(Команда)

	Реквизит3 = Истина;

	Состав.Очистить();

	НоваяСтрока = Состав.Добавить();
	НоваяСтрока.Реквизит3 = Истина;
	НоваяСтрока = Состав.Добавить();

	НоваяСтрока = Состав.Добавить();
	НоваяСтрока.Реквизит3 = Истина;
	НоваяСтрока = Состав.Добавить();

	НоваяСтрока = Состав.Добавить();
	НоваяСтрока.Реквизит3 = Истина;
	НоваяСтрока = Состав.Добавить();

	Тест7НаСервере();

КонецПроцедуры

&НаКлиенте
Процедура Тест8(Команда)

	Состав.Очистить();

	НоваяСтрока = Состав.Добавить();
	НоваяСтрока.Реквизит3 = Истина;
	НоваяСтрока = Состав.Добавить();

	НоваяСтрока = Состав.Добавить();
	НоваяСтрока.Реквизит3 = Истина;
	НоваяСтрока = Состав.Добавить();

	НоваяСтрока = Состав.Добавить();
	НоваяСтрока.Реквизит3 = Истина;
	НоваяСтрока = Состав.Добавить();

	Тест8НаСервере();

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Объект внешней обработки, подготовленный к работе с условным оформлением этой формы.
//
// Возвращаемое значение:
//  ВнешняяОбработкаОбъект.Цветик - готовый к построению цепочки объект
&НаСервере
Функция НовыйЦветик()

	Возврат РеквизитФормыВЗначение("Объект").Установить(УсловноеОформление);

КонецФункции

&НаСервере
Процедура ПрименитьУсловноеОформленияНаСервере()

	Цветик = НовыйЦветик();

	УстановитьБезопасныйРежим(Истина);
	Выполнить Результат;

КонецПроцедуры

&НаСервере
Процедура СгенерироватьКодПоТекущемуУсловномуОформлениюНаСервере()

	Результат = НовыйЦветик().СгенерироватьКод();

КонецПроцедуры

&НаСервере
Процедура ОчиститьУсловноОформлениеНаСервере()

	НовыйЦветик().Очистить();

КонецПроцедуры

&НаСервере
Процедура Тест1НаСервере()

	НовыйЦветик()
		.Очистить()
		.Элемент(Элементы.Реквизит2)
			.ГруппаИ()
				.Равно(Элементы.Реквизит2, 5)
			.ЦветФона(WebЦвета.ЛососьСветлый);

	Результат = "Цветик.Установить(УсловноеОформление)
	|	.Очистить()
	|	.Элемент(Элементы.Реквизит2)
	|		.ГруппаИ()
	|			.Равно(Элементы.Реквизит2, 5)
	|		.ЦветФона(WebЦвета.ЛососьСветлый);";

КонецПроцедуры

&НаСервере
Процедура Тест2НаСервере()

	НовыйЦветик()
		.Очистить()
		.Элемент(Элементы.Реквизит2)
			.ГруппаИ()
				.Равно(Элементы.Реквизит2, 0)
				.НеРавно(Элементы.Реквизит3, Истина)
				.ГруппаИли()
					.Равно(Элементы.Реквизит4, Истина)
					.НачинаетсяС(Элементы.Реквизит1, "я")
				.КонецГруппы()
			.КонецГруппы()
			.Оформление("ЦветФона", WebЦвета.Золотой);

	Результат = "Цветик.Установить(УсловноеОформление)
	|	.Очистить()
	|	.Элемент(Элементы.Реквизит2)
	|		.ГруппаИ()
	|			.Равно(Элементы.Реквизит2, 0)
	|			.НеРавно(Элементы.Реквизит3, Истина)
	|			.ГруппаИли()
	|				.Равно(Элементы.Реквизит4, Истина)
	|				.НачинаетсяС(Элементы.Реквизит1, ""я"")
	|			.КонецГруппы()
	|		.КонецГруппы()
	|		.Оформление(""ЦветФона"", WebЦвета.Золотой);";

КонецПроцедуры

&НаСервере
Процедура Тест3НаСервере()

	НовыйЦветик()
		.Очистить()
		.Элемент("Реквизит1, Реквизит2, Реквизит5, Состав")
			.ГруппаИ()
				.Равно(Элементы.Реквизит3, Истина)
			.Оформление("ЦветФона", WebЦвета.ЛососьСветлый);

	Результат = "Цветик.Установить(УсловноеОформление)
	|	.Очистить()
	|	.Элемент(""Реквизит1, Реквизит2, Реквизит5, Состав"")
	|		.ГруппаИ()
	|			.Равно(Элементы.Реквизит3, Истина)
	|		.Оформление(""ЦветФона"", WebЦвета.ЛососьСветлый);";

КонецПроцедуры

&НаСервере
Процедура Тест4НаСервере()

	НовыйЦветик()
		.Очистить()
		.Элемент(Элементы.Реквизит2)
			.ГруппаИ()
				.Равно(Элементы.Реквизит2, 0)
			.Оформление("ЦветФона", WebЦвета.ЛососьСветлый);

	Результат = "Цветик.Установить(УсловноеОформление)
	|	.Очистить()
	|	.Элемент(Элементы.Реквизит2)
	|		.ГруппаИ()
	|			.Равно(Элементы.Реквизит2, 0)
	|		.Оформление(""ЦветФона"", WebЦвета.ЛососьСветлый);";

КонецПроцедуры

&НаСервере
Процедура Тест5НаСервере()

	Массив = Новый Массив;

	Массив.Добавить("Реквизит1");
	Массив.Добавить(Элементы.Реквизит2);
	Массив.Добавить(Элементы.Состав);

	НовыйЦветик()
		.Очистить()
		.Элемент(Массив)
			.ГруппаИ()
				.Равно(Элементы.Реквизит2, 0)
			.Оформление("ЦветФона", WebЦвета.ЛососьСветлый);

	Результат = "Массив = Новый Массив;
	|
	|Массив.Добавить(""Реквизит1"");
	|Массив.Добавить(Элементы.Реквизит2);
	|Массив.Добавить(Элементы.Состав);
	|
	|Цветик.Установить(УсловноеОформление)
	|	.Очистить()
	|	.Элемент(Массив)
	|		.ГруппаИ()
	|			.Равно(Элементы.Реквизит2, 0)
	|		.Оформление(""ЦветФона"", WebЦвета.ЛососьСветлый);";

КонецПроцедуры

&НаСервере
Процедура Тест6НаСервере()

	Массив = Новый Массив;

	Массив.Добавить("Реквизит1");
	Массив.Добавить(Элементы.Реквизит2);
	Массив.Добавить(Элементы.СоставРеквизит2);

	НовыйЦветик()
		.Очистить()
		.Элемент(Массив)
			.ГруппаИ()
				.Равно(Элементы.Реквизит2, 0)
			.ЦветФона(WebЦвета.ЛососьСветлый);

	Результат = "Массив = Новый Массив;
	|
	|Массив.Добавить(""Реквизит1"");
	|Массив.Добавить(Элементы.Реквизит2);
	|Массив.Добавить(Элементы.СоставРеквизит2);
	|
	|Цветик.Установить(УсловноеОформление)
	|	.Очистить()
	|	.Элемент(Массив)
	|		.ГруппаИ()
	|			.Равно(Элементы.Реквизит2, 0)
	|		.ЦветФона(WebЦвета.ЛососьСветлый);";

КонецПроцедуры

&НаСервере
Процедура Тест7НаСервере()

	Массив = Новый Массив;

	Массив.Добавить(Элементы.Реквизит1);
	Массив.Добавить(Элементы.Реквизит2);

	НовыйЦветик()
		.Очистить()
		.Элемент(Массив)
			.ГруппаИ()
				.Равно(Элементы.Реквизит3, Истина)
			.ЦветФона(WebЦвета.ЛососьСветлый);

	НовыйЦветик()
		.Элемент(Элементы.Состав)
			.ГруппаИ()
				.Равно(Элементы.СоставРеквизит3, Истина)
			.Оформление("ЦветФона", WebЦвета.ЛососьСветлый);

	НовыйЦветик()
		.Элемент(Элементы.СоставРеквизит3)
			.ГруппаИ()
				.Равно(Элементы.СоставРеквизит3, Истина)
			.Оформление("ЦветФона", WebЦвета.Аквамарин);

	Результат = "Массив = Новый Массив;
	|
	|Массив.Добавить(Элементы.Реквизит1);
	|Массив.Добавить(Элементы.Реквизит2);
	|
	|Цветик.Установить(УсловноеОформление)
	|	.Очистить()
	|	.Элемент(Массив)
	|		.ГруппаИ()
	|			.Равно(Элементы.Реквизит3, Истина)
	|		.ЦветФона(WebЦвета.ЛососьСветлый);
	|
	|Цветик.Установить(УсловноеОформление)
	|	.Элемент(Элементы.Состав)
	|		.ГруппаИ()
	|			.Равно(Элементы.СоставРеквизит3, Истина)
	|		.Оформление(""ЦветФона"", WebЦвета.ЛососьСветлый);
	|
	|Цветик.Установить(УсловноеОформление)
	|	.Элемент(Элементы.СоставРеквизит3)
	|		.ГруппаИ()
	|			.Равно(Элементы.СоставРеквизит3, Истина)
	|		.Оформление(""ЦветФона"", WebЦвета.Аквамарин);";

КонецПроцедуры

&НаСервере
Процедура Тест8НаСервере()

	НовыйЦветик()
		.Очистить()
		.Элемент(Элементы.Состав)
			.ГруппаИ()
				.Равно(Элементы.СоставРеквизит3, Истина)
			.Оформление("ЦветФона", WebЦвета.ЛососьСветлый);

	Результат = "Цветик.Установить(УсловноеОформление)
	|	.Очистить()
	|	.Элемент(Элементы.Состав)
	|		.ГруппаИ()
	|			.Равно(Элементы.СоставРеквизит3, Истина)
	|		.Оформление(""ЦветФона"", WebЦвета.ЛососьСветлый);";

КонецПроцедуры

#КонецОбласти
