#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СгенерироватьКодПоТекущемуУсловномуОформлению(Команда)

	Результат = "";
	СгенерироватьКодПоТекущемуУсловномуОформлениюНаСервере();

КонецПроцедуры

&НаКлиенте
Процедура ОчиститьУсловноОформление(Команда)
	ОчиститьУсловноОформлениеНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ПрименитьУсловноеОформления(Команда)
	ПрименитьУсловноеОформленияНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура Тест1(Команда)

	Реквизит2 = 5;

	Тест1НаСервере();

КонецПроцедуры

&НаКлиенте
Процедура Тест2(Команда)

	Реквизит2 = 0;
	Реквизит3 = Ложь;
	Реквизит4 = Истина;

	Тест2НаСервере();

КонецПроцедуры

&НаКлиенте
Процедура Тест3(Команда)

	Реквизит3 = Истина;

	Тест3НаСервере();

КонецПроцедуры

&НаКлиенте
Процедура Тест4(Команда)

	Реквизит2 = 0;

	Тест4НаСервере();

КонецПроцедуры

&НаКлиенте
Процедура Тест5(Команда)

	Реквизит2 = 0;

	Состав.Очистить();

	НоваяСтрока = Состав.Добавить();
	НоваяСтрока.Реквизит3 = Истина;
	НоваяСтрока = Состав.Добавить();

	НоваяСтрока = Состав.Добавить();
	НоваяСтрока.Реквизит3 = Истина;
	НоваяСтрока = Состав.Добавить();

	Тест5НаСервере();

КонецПроцедуры

&НаКлиенте
Процедура Тест6(Команда)

	Реквизит2 = 0;

	Состав.Очистить();

	НоваяСтрока = Состав.Добавить();
	НоваяСтрока.Реквизит3 = Истина;
	НоваяСтрока = Состав.Добавить();

	НоваяСтрока = Состав.Добавить();
	НоваяСтрока.Реквизит3 = Истина;
	НоваяСтрока = Состав.Добавить();

	Тест6НаСервере();

КонецПроцедуры

&НаКлиенте
Процедура Тест7(Команда)
	
	Реквизит3 = Истина;

	Состав.Очистить();

	НоваяСтрока = Состав.Добавить();
	НоваяСтрока.Реквизит3 = Истина;
	НоваяСтрока = Состав.Добавить();

	НоваяСтрока = Состав.Добавить();
	НоваяСтрока.Реквизит3 = Истина;
	НоваяСтрока = Состав.Добавить();

	НоваяСтрока = Состав.Добавить();
	НоваяСтрока.Реквизит3 = Истина;
	НоваяСтрока = Состав.Добавить();
	
	Тест7НаСервере();

КонецПроцедуры

&НаКлиенте
Процедура Тест8(Команда)

	Состав.Очистить();

	НоваяСтрока = Состав.Добавить();
	НоваяСтрока.Реквизит3 = Истина;
	НоваяСтрока = Состав.Добавить();

	НоваяСтрока = Состав.Добавить();
	НоваяСтрока.Реквизит3 = Истина;
	НоваяСтрока = Состав.Добавить();

	НоваяСтрока = Состав.Добавить();
	НоваяСтрока.Реквизит3 = Истина;
	НоваяСтрока = Состав.Добавить();

	Тест8НаСервере();

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ПрименитьУсловноеОформленияНаСервере()
	
	УстановитьБезопасныйРежим(Истина);
	Выполнить Результат;

КонецПроцедуры

&НаСервере
Процедура СгенерироватьКодПоТекущемуУсловномуОформлениюНаСервере()

	Результат = Обработки.Цветик.СоздатьОбъект(УсловноеОформление).СгенерироватьКод();

КонецПроцедуры

&НаСервере
Процедура ОчиститьУсловноОформлениеНаСервере()

	Обработки.Цветик.СоздатьОбъект(УсловноеОформление).Очистить();

КонецПроцедуры

&НаСервере
Процедура Тест1НаСервере()

	Обработки.Цветик.СоздатьОбъект(УсловноеОформление)
		.Очистить()
		.Элемент(Элементы.Реквизит2)
			.ГруппаИ()
				.Равно(Элементы.Реквизит2, 5)
			.ЦветФона(WebЦвета.ЛососьСветлый);
			
	Результат = "Обработки.Цветик.СоздатьОбъект(УсловноеОформление)
	|	.Очистить()
	|	.Элемент(Элементы.Реквизит2)
	|		.ГруппаИ()
	|			.Равно(Элементы.Реквизит2, 5)
	|		.ЦветФона(WebЦвета.ЛососьСветлый);";
		
КонецПроцедуры

&НаСервере
Процедура Тест2НаСервере()
	
	Обработки.Цветик.СоздатьОбъект(УсловноеОформление)
		.Очистить()
		.Элемент(Элементы.Реквизит2)
			.ГруппаИ()
				.Равно(Элементы.Реквизит2, 0)
				.НеРавно(Элементы.Реквизит3, Истина)
				.ГруппаИли()
					.Равно(Элементы.Реквизит4, Истина)
					.НачинаетсяС(Элементы.Реквизит1, "я")
				.КонецГруппы()
			.КонецГруппы()
			.Оформление("ЦветФона", WebЦвета.Золотой);
	
	Результат = "Обработки.Цветик.СоздатьОбъект(УсловноеОформление)
	|	.Очистить()
	|	.Элемент(Элементы.Реквизит2)
	|		.ГруппаИ()
	|			.Равно(Элементы.Реквизит2, 0)
	|			.НеРавно(Элементы.Реквизит3, Истина)
	|			.ГруппаИли()
	|				.Равно(Элементы.Реквизит4, Истина)
	|				.НачинаетсяС(Элементы.Реквизит1, ""я"")
	|			.КонецГруппы()
	|		.КонецГруппы()
	|		.Оформление(""ЦветФона"", WebЦвета.Золотой);";
	
КонецПроцедуры

&НаСервере
Процедура Тест3НаСервере()
	
	Обработки.Цветик.СоздатьОбъект(УсловноеОформление)
		.Очистить()
		.Элемент("Реквизит1, Реквизит2, Реквизит5, Состав")
			.ГруппаИ()
				.Равно(Элементы.Реквизит3, Истина)
			.Оформление("ЦветФона", WebЦвета.ЛососьСветлый);
		
	Результат = "Обработки.Цветик.СоздатьОбъект(УсловноеОформление)
	|	.Очистить()
	|	.Элемент(""Реквизит1, Реквизит2, Реквизит5, Состав"")
	|		.ГруппаИ()
	|			.Равно(Элементы.Реквизит3, Истина)
	|		.Оформление(""ЦветФона"", WebЦвета.ЛососьСветлый);";
	
КонецПроцедуры

&НаСервере
Процедура Тест4НаСервере()
	
	Обработки.Цветик.СоздатьОбъект(УсловноеОформление)
		.Очистить()
		.Элемент(Элементы.Реквизит2)
			.ГруппаИ()
				.Равно(Элементы.Реквизит2, 0)
			.Оформление("ЦветФона", WebЦвета.ЛососьСветлый);
	
	Результат = "Обработки.Цветик.СоздатьОбъект(УсловноеОформление)
	|	.Очистить()
	|	.Элемент(Элементы.Реквизит2)
	|		.ГруппаИ()
	|			.Равно(Элементы.Реквизит2, 0)
	|		.Оформление(""ЦветФона"", WebЦвета.ЛососьСветлый);";
	
КонецПроцедуры

&НаСервере
Процедура Тест5НаСервере()
	
	Массив = Новый Массив;
	
	Массив.Добавить("Реквизит1");
	Массив.Добавить(Элементы.Реквизит2);
	Массив.Добавить(Элементы.Состав);
	
	Обработки.Цветик.СоздатьОбъект(УсловноеОформление)
		.Очистить()
		.Элемент(Массив)
			.ГруппаИ()
				.Равно(Элементы.Реквизит2, 0)
			.Оформление("ЦветФона", WebЦвета.ЛососьСветлый);

	Результат = "Массив = Новый Массив;
	|
	|Массив.Добавить(""Реквизит1"");
	|Массив.Добавить(Элементы.Реквизит2);
	|Массив.Добавить(Элементы.Состав);
	|
	|Обработки.Цветик.СоздатьОбъект(УсловноеОформление)
	|	.Очистить()
	|	.Элемент(Массив)
	|		.ГруппаИ()
	|			.Равно(Элементы.Реквизит2, 0)
	|		.Оформление(""ЦветФона"", WebЦвета.ЛососьСветлый);";
			
КонецПроцедуры

&НаСервере
Процедура Тест6НаСервере()
	
	Массив = Новый Массив;
	
	Массив.Добавить("Реквизит1");
	Массив.Добавить(Элементы.Реквизит2);
	Массив.Добавить(Элементы.СоставРеквизит2);
	
	Обработки.Цветик.СоздатьОбъект(УсловноеОформление)
		.Очистить()
		.Элемент(Массив)
			.ГруппаИ()
				.Равно(Элементы.Реквизит2, 0)
			.ЦветФона(WebЦвета.ЛососьСветлый);
			
	Результат = "Массив = Новый Массив;
	|
	|Массив.Добавить(""Реквизит1"");
	|Массив.Добавить(Элементы.Реквизит2);
	|Массив.Добавить(Элементы.СоставРеквизит2);
	|
	|Обработки.Цветик.СоздатьОбъект(УсловноеОформление)
	|	.Очистить()
	|	.Элемент(Массив)
	|		.ГруппаИ()
	|			.Равно(Элементы.Реквизит2, 0)
	|		.ЦветФона(WebЦвета.ЛососьСветлый);";
	
КонецПроцедуры

&НаСервере
Процедура Тест7НаСервере()
	
	Массив = Новый Массив;

	Массив.Добавить(Элементы.Реквизит1);
	Массив.Добавить(Элементы.Реквизит2);

	Обработки.Цветик.СоздатьОбъект(УсловноеОформление)
		.Очистить()
		.Элемент(Массив)
			.ГруппаИ()
				.Равно(Элементы.Реквизит3, Истина)
			.ЦветФона(WebЦвета.ЛососьСветлый);

	Обработки.Цветик.СоздатьОбъект(УсловноеОформление)
		.Элемент(Элементы.Состав)
			.ГруппаИ()
				.Равно(Элементы.СоставРеквизит3, Истина)
			.Оформление("ЦветФона", WebЦвета.ЛососьСветлый);
	
	Обработки.Цветик.СоздатьОбъект(УсловноеОформление)
		.Элемент(Элементы.СоставРеквизит3)
			.ГруппаИ()
				.Равно(Элементы.СоставРеквизит3, Истина)
			.Оформление("ЦветФона", WebЦвета.Аквамарин);
			
	Результат = "Массив = Новый Массив;
	|
	|Массив.Добавить(Элементы.Реквизит1);
	|Массив.Добавить(Элементы.Реквизит2);
	|
	|Обработки.Цветик.СоздатьОбъект(УсловноеОформление)
	|	.Очистить()
	|	.Элемент(Массив)
	|		.ГруппаИ()
	|			.Равно(Элементы.Реквизит3, Истина)
	|		.ЦветФона(WebЦвета.ЛососьСветлый);
	|
	|Обработки.Цветик.СоздатьОбъект(УсловноеОформление)
	|	.Элемент(Элементы.Состав)
	|		.ГруппаИ()
	|			.Равно(Элементы.СоставРеквизит3, Истина)
	|		.Оформление(""ЦветФона"", WebЦвета.ЛососьСветлый);
	|
	|Обработки.Цветик.СоздатьОбъект(УсловноеОформление)
	|	.Элемент(Элементы.СоставРеквизит3)
	|		.ГруппаИ()
	|			.Равно(Элементы.СоставРеквизит3, Истина)
	|		.Оформление(""ЦветФона"", WebЦвета.Аквамарин);";

КонецПроцедуры

&НаСервере
Процедура Тест8НаСервере()
	
	Обработки.Цветик.СоздатьОбъект(УсловноеОформление)
		.Очистить()	
		.Элемент(Элементы.Состав)
			.ГруппаИ()
				.Равно(Элементы.СоставРеквизит3, Истина)
			.Оформление("ЦветФона", WebЦвета.ЛососьСветлый);
			
	Результат = "Обработки.Цветик.СоздатьОбъект(УсловноеОформление)
	|	.Очистить()	
	|	.Элемент(Элементы.Состав)
	|		.ГруппаИ()
	|			.Равно(Элементы.СоставРеквизит3, Истина)
	|		.Оформление(""ЦветФона"", WebЦвета.ЛососьСветлый);";

КонецПроцедуры

#КонецОбласти