#Область ОписаниеПеременных

Перем УсловноеОформление;
Перем Элемент;
Перем ГруппаОтбора;
Перем ТекущийЭлемент;

#КонецОбласти

#Область ПрограммныйИнтерфейс

// Элемент.
// 
// Параметры:
//  Имя - Строка - Имя
// 
// Возвращаемое значение:
//  ОбработкаОбъект.УсловноеОформление - Элемент
Функция Элемент(Имя = "") Экспорт

	Если Не ЗначениеЗаполнено(Имя) Тогда
		Имя = XMLСтрока(Новый УникальныйИдентификатор);
	КонецЕсли;

	Элемент = УсловноеОформление.Элементы.Добавить();
	ТекущийЭлемент = Элемент;

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Имя);

	Возврат ЭтотОбъект;

КонецФункции

Функция Очистить() Экспорт

	УсловноеОформление.Элементы.Очистить();

	Возврат ЭтотОбъект;

КонецФункции

// Оформление.
// 
// Параметры:
//  Свойство - Строка - "ОтметкаНезаполненного", 
//  Значение - Произвольный - 
// 
// Возвращаемое значение:
//  ОбработкаОбъект.УсловноеОформление - Оформление
Функция Оформление(Свойство, Значение) Экспорт

	ПроверкаЭлемента();

	Элемент.Оформление.УстановитьЗначениеПараметра(Свойство, Значение);

	Возврат ЭтотОбъект;

КонецФункции

// Генерирует код, который можно копипасть к себе на основании передоного в объект условного  офрмелния
// 
// Возвращаемое значение:
//  Строка - готовый код
Функция СгенерироватьКод() Экспорт

	Результат = "Обработки.УсловноеОформление.СоздатьОбъект(УсловноеОформление)";

	ШаблонОформления = Символы.ПС + Табуляция(3) + ".Оформление(""%1"", %2)";

	Для Каждого Элемент Из УсловноеОформление.Элементы Цикл

		Если Не Элемент.Использование Тогда
			Продолжить;
		КонецЕсли;
		
		// ToDo: Группы
		
		// ToDo: Отборы

		Для Каждого Оформление Из Элемент.Оформление.Элементы Цикл

			Если Не Оформление.Использование Тогда
				Продолжить;
			КонецЕсли;

			Результат = Результат + СтрШаблон(ШаблонОформления, Строка(Оформление.Параметр),
				ВернутьЗначениеДляОформления(Оформление.Значение));
		КонецЦикла;

	КонецЦикла;

	Возврат Результат;

КонецФункции

#Область Группы

Функция ГруппаИ() Экспорт

	ПроверкаЭлемента();

	ГруппаОтбора = ТекущийЭлемент.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ГруппаОтбора.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ;

	ТекущийЭлемент = ГруппаОтбора;

	Возврат ЭтотОбъект;

КонецФункции

Функция ГруппаИли() Экспорт

	ПроверкаЭлемента();

	ГруппаОтбора = ТекущийЭлемент.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ГруппаОтбора.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИли;

	ТекущийЭлемент = ГруппаОтбора;

	Возврат ЭтотОбъект;

КонецФункции

Функция ГруппаНе() Экспорт

	ПроверкаЭлемента();

	ГруппаОтбора = ТекущийЭлемент.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ГруппаОтбора.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаНе;

	ТекущийЭлемент = ГруппаОтбора;

	Возврат ЭтотОбъект;

КонецФункции

Функция КонецГруппы() Экспорт

	ПроверкаЭлемента();

	Если ТекущийЭлемент.Родитель <> Неопределено Тогда
		ТекущийЭлемент = ТекущийЭлемент.Родитель;
	КонецЕсли;

	Возврат ЭтотОбъект;

КонецФункции

#КонецОбласти

#Область Отборы

// Равно.
// 
// Параметры:
//  Поле - Строка - Пример: "Объект.Товары.ТипНоменклатуры", "Объект.Статус", "АдресноеХранение"
//  Значение - Произвольный - ПравоеЗначение
// 
// Возвращаемое значение:
//  ОбработкаОбъект.УсловноеОформление - Равно
Функция Равно(Поле, Значение) Экспорт

	ОтборЭлемента = ТекущийЭлемент.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(Поле);
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Значение;

	Возврат ЭтотОбъект;

КонецФункции

// Больше.
// 
// Параметры:
//  Поле - Строка - Пример: "Объект.Товары.ТипНоменклатуры", "Объект.Статус", "АдресноеХранение"
//  Значение - Произвольный - ПравоеЗначение
// 
// Возвращаемое значение:
//  ОбработкаОбъект.УсловноеОформление - Больше
Функция Больше(Поле, Значение) Экспорт

	ОтборЭлемента = ТекущийЭлемент.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(Поле);
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Больше;
	ОтборЭлемента.ПравоеЗначение = Значение;

	Возврат ЭтотОбъект;

КонецФункции

// БольшеИлиРавно.
// 
// Параметры:
//  Поле - Строка - Пример: "Объект.Товары.ТипНоменклатуры", "Объект.Статус", "АдресноеХранение"
//  Значение - Произвольный - ПравоеЗначение
// 
// Возвращаемое значение:
//  ОбработкаОбъект.УсловноеОформление - БольшеИлиРавно
Функция БольшеИлиРавно(Поле, Значение) Экспорт

	ОтборЭлемента = ТекущийЭлемент.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(Поле);
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.БольшеИлиРавно;
	ОтборЭлемента.ПравоеЗначение = Значение;

	Возврат ЭтотОбъект;

КонецФункции

// ВИерархии.
// 
// Параметры:
//  Поле - Строка - Пример: "Объект.Товары.ТипНоменклатуры", "Объект.Статус", "АдресноеХранение"
//  Значение - Произвольный - ПравоеЗначение
// 
// Возвращаемое значение:
//  ОбработкаОбъект.УсловноеОформление - ВИерархии
Функция ВИерархии(Поле, Значение) Экспорт

	ОтборЭлемента = ТекущийЭлемент.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(Поле);
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.ВИерархии;
	ОтборЭлемента.ПравоеЗначение = Значение;

	Возврат ЭтотОбъект;

КонецФункции

// ВСписке.
// 
// Параметры:
//  Поле - Строка - Пример: "Объект.Товары.ТипНоменклатуры", "Объект.Статус", "АдресноеХранение"
//  Значение - Произвольный - ПравоеЗначение
// 
// Возвращаемое значение:
//  ОбработкаОбъект.УсловноеОформление - ВСписке
Функция ВСписке(Поле, Значение) Экспорт

	ОтборЭлемента = ТекущийЭлемент.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(Поле);
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке;
	ОтборЭлемента.ПравоеЗначение = Значение;

	Возврат ЭтотОбъект;

КонецФункции

// ВСпискеПоИерархии.
// 
// Параметры:
//  Поле - Строка - Пример: "Объект.Товары.ТипНоменклатуры", "Объект.Статус", "АдресноеХранение"
//  Значение - Произвольный - ПравоеЗначение
// 
// Возвращаемое значение:
//  ОбработкаОбъект.УсловноеОформление - ВСпискеПоИерархии
Функция ВСпискеПоИерархии(Поле, Значение) Экспорт

	ОтборЭлемента = ТекущийЭлемент.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(Поле);
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСпискеПоИерархии;
	ОтборЭлемента.ПравоеЗначение = Значение;

	Возврат ЭтотОбъект;

КонецФункции

// Заполнено.
// 
// Параметры:
//  Поле - Строка - Пример: "Объект.Товары.ТипНоменклатуры", "Объект.Статус", "АдресноеХранение"
//  Значение - Произвольный - ПравоеЗначение
// 
// Возвращаемое значение:
//  ОбработкаОбъект.УсловноеОформление - Заполнено
Функция Заполнено(Поле, Значение) Экспорт

	ОтборЭлемента = ТекущийЭлемент.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(Поле);
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Заполнено;
	ОтборЭлемента.ПравоеЗначение = Значение;

	Возврат ЭтотОбъект;

КонецФункции

// Меньше.
// 
// Параметры:
//  Поле - Строка - Пример: "Объект.Товары.ТипНоменклатуры", "Объект.Статус", "АдресноеХранение"
//  Значение - Произвольный - ПравоеЗначение
// 
// Возвращаемое значение:
//  ОбработкаОбъект.УсловноеОформление - Меньше
Функция Меньше(Поле, Значение) Экспорт

	ОтборЭлемента = ТекущийЭлемент.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(Поле);
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Меньше;
	ОтборЭлемента.ПравоеЗначение = Значение;

	Возврат ЭтотОбъект;

КонецФункции

// МеньшеИлиРавно.
// 
// Параметры:
//  Поле - Строка - Пример: "Объект.Товары.ТипНоменклатуры", "Объект.Статус", "АдресноеХранение"
//  Значение - Произвольный - ПравоеЗначение
// 
// Возвращаемое значение:
//  ОбработкаОбъект.УсловноеОформление - МеньшеИлиРавно
Функция МеньшеИлиРавно(Поле, Значение) Экспорт

	ОтборЭлемента = ТекущийЭлемент.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(Поле);
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.МеньшеИлиРавно;
	ОтборЭлемента.ПравоеЗначение = Значение;

	Возврат ЭтотОбъект;

КонецФункции

// НачинаетсяС.
// 
// Параметры:
//  Поле - Строка - Пример: "Объект.Товары.ТипНоменклатуры", "Объект.Статус", "АдресноеХранение"
//  Значение - Произвольный - ПравоеЗначение
// 
// Возвращаемое значение:
//  ОбработкаОбъект.УсловноеОформление - НачинаетсяС
Функция НачинаетсяС(Поле, Значение) Экспорт

	ОтборЭлемента = ТекущийЭлемент.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(Поле);
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.НачинаетсяС;
	ОтборЭлемента.ПравоеЗначение = Значение;

	Возврат ЭтотОбъект;

КонецФункции

// НеВИерархии.
// 
// Параметры:
//  Поле - Строка - Пример: "Объект.Товары.ТипНоменклатуры", "Объект.Статус", "АдресноеХранение"
//  Значение - Произвольный - ПравоеЗначение
// 
// Возвращаемое значение:
//  ОбработкаОбъект.УсловноеОформление - НеВИерархии
Функция НеВИерархии(Поле, Значение) Экспорт

	ОтборЭлемента = ТекущийЭлемент.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(Поле);
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.НеВИерархии;
	ОтборЭлемента.ПравоеЗначение = Значение;

	Возврат ЭтотОбъект;

КонецФункции

// НеВСписке.
// 
// Параметры:
//  Поле - Строка - Пример: "Объект.Товары.ТипНоменклатуры", "Объект.Статус", "АдресноеХранение"
//  Значение - Произвольный - ПравоеЗначение
// 
// Возвращаемое значение:
//  ОбработкаОбъект.УсловноеОформление - НеВСписке
Функция НеВСписке(Поле, Значение) Экспорт

	ОтборЭлемента = ТекущийЭлемент.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(Поле);
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.НеВСписке;
	ОтборЭлемента.ПравоеЗначение = Значение;

	Возврат ЭтотОбъект;

КонецФункции

// НеВСпискеПоИерархии.
// 
// Параметры:
//  Поле - Строка - Пример: "Объект.Товары.ТипНоменклатуры", "Объект.Статус", "АдресноеХранение"
//  Значение - Произвольный - ПравоеЗначение
// 
// Возвращаемое значение:
//  ОбработкаОбъект.УсловноеОформление - НеВСпискеПоИерархии
Функция НеВСпискеПоИерархии(Поле, Значение) Экспорт

	ОтборЭлемента = ТекущийЭлемент.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(Поле);
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.НеВСпискеПоИерархии;
	ОтборЭлемента.ПравоеЗначение = Значение;

	Возврат ЭтотОбъект;

КонецФункции

// НеЗаполнено.
// 
// Параметры:
//  Поле - Строка - Пример: "Объект.Товары.ТипНоменклатуры", "Объект.Статус", "АдресноеХранение"
//  Значение - Произвольный - ПравоеЗначение
// 
// Возвращаемое значение:
//  ОбработкаОбъект.УсловноеОформление - НеЗаполнено
Функция НеЗаполнено(Поле, Значение) Экспорт

	ОтборЭлемента = ТекущийЭлемент.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(Поле);
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.НеЗаполнено;
	ОтборЭлемента.ПравоеЗначение = Значение;

	Возврат ЭтотОбъект;

КонецФункции

// НеНачинаетсяС.
// 
// Параметры:
//  Поле - Строка - Пример: "Объект.Товары.ТипНоменклатуры", "Объект.Статус", "АдресноеХранение"
//  Значение - Произвольный - ПравоеЗначение
// 
// Возвращаемое значение:
//  ОбработкаОбъект.УсловноеОформление - НеНачинаетсяС
Функция НеНачинаетсяС(Поле, Значение) Экспорт

	ОтборЭлемента = ТекущийЭлемент.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(Поле);
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.НеНачинаетсяС;
	ОтборЭлемента.ПравоеЗначение = Значение;

	Возврат ЭтотОбъект;

КонецФункции

// НеПодобно.
// 
// Параметры:
//  Поле - Строка - Пример: "Объект.Товары.ТипНоменклатуры", "Объект.Статус", "АдресноеХранение"
//  Значение - Произвольный - ПравоеЗначение
// 
// Возвращаемое значение:
//  ОбработкаОбъект.УсловноеОформление - НеПодобно
Функция НеПодобно(Поле, Значение) Экспорт

	ОтборЭлемента = ТекущийЭлемент.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(Поле);
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.НеПодобно;
	ОтборЭлемента.ПравоеЗначение = Значение;

	Возврат ЭтотОбъект;

КонецФункции

// НеРавно.
// 
// Параметры:
//  Поле - Строка - Пример: "Объект.Товары.ТипНоменклатуры", "Объект.Статус", "АдресноеХранение"
//  Значение - Произвольный - ПравоеЗначение
// 
// Возвращаемое значение:
//  ОбработкаОбъект.УсловноеОформление - НеРавно
Функция НеРавно(Поле, Значение) Экспорт

	ОтборЭлемента = ТекущийЭлемент.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(Поле);
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.НеРавно;
	ОтборЭлемента.ПравоеЗначение = Значение;

	Возврат ЭтотОбъект;

КонецФункции

// НеСодержит.
// 
// Параметры:
//  Поле - Строка - Пример: "Объект.Товары.ТипНоменклатуры", "Объект.Статус", "АдресноеХранение"
//  Значение - Произвольный - ПравоеЗначение
// 
// Возвращаемое значение:
//  ОбработкаОбъект.УсловноеОформление - НеСодержит
Функция НеСодержит(Поле, Значение) Экспорт

	ОтборЭлемента = ТекущийЭлемент.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(Поле);
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.НеСодержит;
	ОтборЭлемента.ПравоеЗначение = Значение;

	Возврат ЭтотОбъект;

КонецФункции

// Подобно.
// 
// Параметры:
//  Поле - Строка - Пример: "Объект.Товары.ТипНоменклатуры", "Объект.Статус", "АдресноеХранение"
//  Значение - Произвольный - ПравоеЗначение
// 
// Возвращаемое значение:
//  ОбработкаОбъект.УсловноеОформление - Подобно
Функция Подобно(Поле, Значение) Экспорт

	ОтборЭлемента = ТекущийЭлемент.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(Поле);
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Подобно;
	ОтборЭлемента.ПравоеЗначение = Значение;

	Возврат ЭтотОбъект;

КонецФункции

// Содержит.
// 
// Параметры:
//  Поле - Строка - Пример: "Объект.Товары.ТипНоменклатуры", "Объект.Статус", "АдресноеХранение"
//  Значение - Произвольный - ПравоеЗначение
// 
// Возвращаемое значение:
//  ОбработкаОбъект.УсловноеОформление - Содержит
Функция Содержит(Поле, Значение) Экспорт

	ОтборЭлемента = ТекущийЭлемент.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(Поле);
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Содержит;
	ОтборЭлемента.ПравоеЗначение = Значение;

	Возврат ЭтотОбъект;

КонецФункции

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Установить.
// 
// Параметры:
//  НовоеУсловноеОформление - УсловноеОформлениеКомпоновкиДанных
Процедура Установить(НовоеУсловноеОформление) Экспорт

	УсловноеОформление = НовоеУсловноеОформление;

КонецПроцедуры

Процедура ПроверкаЭлемента()

	Если ТекущийЭлемент = Неопределено Тогда
		ВызватьИсключение НСтр("Сначала вызовите метод ""Элемент""");
	КонецЕсли;

КонецПроцедуры

Функция Табуляция(Раз)

	Результат = "";

	Для Счетчик = 1 По Раз Цикл
		Результат = Результат + Символы.Таб;
	КонецЦикла;

	Возврат Результат;

КонецФункции

Функция ВернутьЗначениеДляОформления(Значение)

	Результат = "";
	ТипЗначения = ТипЗнч(Значение);

	// ToDo: Другие вариации условий
	
	Если ТипЗначения = Тип("Цвет") Тогда

		Если Значение.Вид = ВидЦвета.WebЦвет Тогда
			Значение = Строка(Значение);

			НачалоАнглийского = СтрНайти(Значение, "(");

			Если НачалоАнглийского <> 0 Тогда
				Значение = Сред(Значение, 1, НачалоАнглийского - 1);
			КонецЕсли;

			Результат = СтрШаблон("WebЦвета[%1]", СтрЗаменить(Значение, " ", ""));
		КонецЕсли;

	КонецЕсли;

	Возврат Результат;

КонецФункции

#КонецОбласти