#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	
	Обработки.УсловноеОформление.СоздатьОбъект(УсловноеОформление)
		.Элемент("Реквизит1")
			.ГруппаИ()
				.Равно("Объект.Реквизит1", 5)
		.Оформление("ЦветФона", WebЦвета.ЛососьСветлый);
	
	
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПриминитьУстлофноеОформление(Команда)
	ПриминитьУстлофноеОформлениеНаСервере();
КонецПроцедуры

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ПриминитьУстлофноеОформлениеНаСервере()
	
	УФ = Обработки.УсловноеОформление.СоздатьОбъект(УсловноеОформление);
	
	УФ.Очистить()
		.Элемент("Тест")
			.ГруппаИ()
				.Равно("Объект.Реквизит1", 3)
		.Оформление("ЦветФона", WebЦвета.Аквамарин);
	
КонецПроцедуры

#КонецОбласти

