#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	
	Обработки.Цветик.СоздатьОбъект(УсловноеОформление)
		.Элемент("Реквизит1")
			.ГруппаИ()
				.Равно("Объект.Реквизит1", 5)
		.Оформление("ЦветФона", WebЦвета.ЛососьСветлый);
	
	
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПриминитьУстлофноеОформление(Команда)
	ПриминитьУстлофноеОформлениеНаСервере();
КонецПроцедуры


&НаКлиенте
Процедура Команда1(Команда)
	Команда1НаСервере();
КонецПроцедуры
#КонецОбласти


#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ПриминитьУстлофноеОформлениеНаСервере()
	
	УстановитьБезопасныйРежим(Истина);
	Выполнить Тест;
	
КонецПроцедуры

&НаСервере
Процедура Команда1НаСервере()
	
	Тест = Обработки.Цветик.СоздатьОбъект(УсловноеОформление).СгенерироватьКод();	

КонецПроцедуры

#КонецОбласти

